app/controllers/users/omniauth_callbacks_controller.rb

  def slack
    # We have received a response from the omniauth callback - commence user and team creation
    response = request.env["omniauth.auth"]
    @user = User.from_omniauth(response)
    team = Team.create_or_update_from_slack(response)
    user.teams << team
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "role", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"